app/controllers/songs_controller.rb

  def index
    if params[:artist_id] && @artist = Artist.find_by_id(params[:artist_id])
      @songs = @artist.songs
    elsif
      params[:artist_id] && @artist = !Artist.find_by_id(params[:artist_id])
      flash[:notice] = "Artist not found."
      redirect_to artists_path
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
SELECT "songs".* FROM "songs"

  def show
    if params[:artist_id] && @song = !Song.find_by_id(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]